{"_id":{"$oid":"59ddcfff65ff6c371ee43058"},"image":{"original_filename":"PLG bowen website-38","context":{"custom":{"photo":"undefined 11 - 11:2:6"}},"secure_url":"https://res.cloudinary.com/fourandonegroup-com/image/upload/v1507708926/whx7nxbni2aavpteiwve.jpg","url":"http://res.cloudinary.com/fourandonegroup-com/image/upload/v1507708926/whx7nxbni2aavpteiwve.jpg","etag":"66dbba2f939328a04fde7f17f459d465","type":"upload","bytes":1502036,"tags":["PLG TRADE undefined Bowen"],"created_at":"2017-10-11T08:02:06Z","resource_type":"image","format":"jpg","height":1844,"width":1844,"signature":"5cee8f4a9197d94af18875370a0150e051e4ff49","version":1507708926,"public_id":"whx7nxbni2aavpteiwve"},"title":"Bowen","info":"\u003cp\u003eBy the end of the 1970s, British fashion reemerged from the Italian shade, with its Goodyear welt construction entering the vogue scene with conviction. It is in this context that Bowen was born in 1980: an innovative Franglish brand, an optimal mix of French ideas and British manufacturing.\u003cbr/\u003eIt all started when a few enlightened French men travelled to Northampton, “the Goodyear temple”, with the objective of launching a Goodyear shoe collection at an affordable prize for the trendy Parisian men.\u003cbr/\u003eGoodyear welt construction increases the shoe’s quality by adding solidity, ventilation, comfort and isolation, and by allowing a continued resoling and therefore increasing its lifespan.\u003cbr/\u003eThis genetic heritage – 100% Goodyear, 100% hand stitched, 100% leather, 100% made in England – together with a sophisticated and trendy look, turned Bowen into an immediate success. The brand grew progressively, expanding its network of boutiques and distribution points and strengthening its reputation. In 2000 it also expanded its production methods, opening a workshop in Toscana that brought the possibility of enriching the Goodyear construction with the creative secrets of Italian methods.\u003cbr/\u003e\u003c/p\u003e","__v":0}
{"_id":{"$oid":"59ddd07965ff6c371ee4305a"},"image":{"original_filename":"IMG_3426","context":{"custom":{"photo":"undefined 14 - 13:26:34"}},"secure_url":"https://res.cloudinary.com/fourandonegroup-com/image/upload/v1521023195/jqdtujuhui2gvppnsdqp.jpg","url":"http://res.cloudinary.com/fourandonegroup-com/image/upload/v1521023195/jqdtujuhui2gvppnsdqp.jpg","placeholder":false,"etag":"caa4a472f1896b0b4cd03de4b13a9d4b","type":"upload","bytes":70726,"tags":["PLG TRADE undefined Fairmount"],"created_at":"2018-03-14T10:26:35Z","resource_type":"image","format":"jpg","height":683,"width":1024,"signature":"fb0edaf480c99d794ab403690ebaafe24aab4473","version":1521023195,"public_id":"jqdtujuhui2gvppnsdqp"},"title":"Fairmount","info":"\u003cp\u003eFairmount founders’ idea to be the leader in terms of American shoe basics, came from New England and the state of Maine, renowned for its quality shoes. Located near the Great Lakes region and surrounded by splendid forests, it was home to the Algonquin tribes.\u003cbr/\u003eThe Algonquin tribes and other American Native Indians use to wear shoes that were made of a single piece of soft leather. \u003cbr/\u003eThey were so elastic, soundless and, comfortable that even trappers adopted them to run in the woods.\u003cbr/\u003eOver the years the original moccasin gradually evolved into the American lifestyle. Today, by trying a sole-free hand sewn moccasin, you can feel the same comfort Native Indians felt when walking. \u003cbr/\u003eFairmount mocassin are still \u003cbr/\u003ehand-stitched and assembled on a mold, respecting traditional methods. \u003cbr/\u003eThe sole and sides of the shoe made in soft leather are hand-stitched together at the top around the mold, using a double needle sewing. \u003cbr/\u003e\u003c/p\u003e","__v":0}
